content-org/all-posts.org
#+hugo_base_dir: ../
#+startup: indent showall

* About
:PROPERTIES:
:EXPORT_HUGO_SECTION: 
:EXPORT_HUGO_MENU: :menu "main"
:EXPORT_FILE_NAME: about
:END:

+ Name: Tomás Carvalho;
+ Based: Lisbon;
+ Occupation(Main): Studying Computer Science Engineering at [[https://tecnico.ulisboa.pt/en/][IST]];

I enjoy to study mathematics, in particular cryptography and abstract
algebra. 

** thetimesweeper.com

The domain of this website is inspired in one of my favourite
videogames, /Blinx: The Time Sweeper/ (as well as my logo).

This website is built with emacs ~org-mode~, ~ox-hugo~ and ~hugo~.

*** License

All original code, as well as any inline documentation, is available
under the terms of the [[https://www.gnu.org/licenses/gpl-3.0.html][GNU General Public License Version 3]].

All original text, such as articles and blog posts, is available under
the [[https://creativecommons.org/licenses/by-sa/4.0/legalcode][Creative Commons Attribution-ShareAlike 4.0 International]].

** Also on

+ [[https://github.com/n1ghtbyte][GitHub]]
+ Libera.chat
  
