content/about.md
+++
title = "About"
draft = false
[menu]
  [menu.main]
    weight = 1002
    identifier = "about"
+++

-   Name: Tomás Carvalho;
-   Based: Lisbon;
-   Occupation(Main): Studying Computer Science Engineering at [IST](https://tecnico.ulisboa.pt/en/);

I enjoy to study mathematics, in particular cryptography and abstract
algebra.


## thetimesweeper.com {#thetimesweeper-dot-com}

The domain of this website is inspired in one of my favourite
videogames, _Blinx: The Time Sweeper_ (as well as my logo).

This website is built with emacs `org-mode`, `ox-hugo` and `hugo`.


### License {#license}

All original code, as well as any inline documentation, is available
under the terms of the [GNU General Public License Version 3](https://www.gnu.org/licenses/gpl-3.0.html).

All original text, such as articles and blog posts, is available under
the [Creative Commons Attribution-ShareAlike 4.0 International](https://creativecommons.org/licenses/by-sa/4.0/legalcode).


## Also on {#also-on}

-   [GitHub](https://github.com/n1ghtbyte)
-   Libera.chat
